{
  "id": 77467,
  "type": 1,
  "status": 2,
  "agent_id": 3763909,
  "created_at": "2013-04-19T11:51:42Z",
  "category_id": 81138,
  "folder_id": 133138,
  "title": "Tariffs and Rates",
  "updated_at": "2020-01-11T00:21:34Z",
  "description": "<h3><span style=\"font-size: 18px;\">Tariffs and Rates</span></h3><p><br>A Tariff is a logical element in the system which represents the rules for rating and billing the calls made by an Account or Customer. Each Tariff includes a set of Rates that define the prices to be charged for calls to different destinations. Tariffs are created by Customers. Each Customer has its own set of Tariffs it can assign to his own sub-Customers or Accounts. The system ensures that sub-Customers can only see the Tariffs that apply to them directly.<br><br>There can be more than one Rate matching a destination number; in such cases, the Rate with the longest prefix is used.  For example, if the destination number is 1234567890 and there are two Rates, each with the prefix 1 and 12 respectively, the Rate with the prefix 12 would be selected for rating and billing purposes.  It is important to know that Accounts or Customers cannot complete calls to destinations for which a Rate is not configured.</p><p><br></p><table style=\"width: 100%;\"><tbody><tr><td style=\"width: 100%; background-color: rgb(255, 251, 194);\"><div style=\"text-align: justify;\">Changes to <strong>Rates</strong>, <strong>Routes</strong>, <strong>Destination Sets</strong>, <strong>Tariffs</strong>, <strong>DID numbers</strong>, <strong>DID Charging Groups</strong> and <strong>Routing Groups</strong> may not be applied immediately.  You need to wait at least for 1 minute before the system can update its internal \"cache\". Sometimes; for example,  in case of a heavy bulk update of multiple destination sets, it may be necessary to wait more than 1 minute. <a href=\"https://support.sippysoft.com/a/solutions/articles/3000093931\" rel=\"noopener noreferrer\" target=\"_blank\">Read more about System Cache...</a></div></td></tr></tbody></table><p><br></p><h3><span style=\"font-size: 18px;\">Adding, Updating, and Deleting a Tariff</span></h3><p><br></p><p>On the Tariffs page (shown below), you can add a new Tariff, update an existing Tariff, or delete an existing Tariff.</p><p><br></p><p><img style=\"cursor: default;\" src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/4989513/original/TariffsandRates.png?1366371302\" class=\"fr-dii\"></p><p><br></p><p>To <strong>add</strong> a <strong>new Tariff</strong>, inside the Add Tariff section, select Add New.  On the Add New Tariff page, enter the desired values inside the Basic Parameters and Advanced Parameters sections.  Note that you must enter a Tariff Name.  When you are done, select Save &amp; Close.  The new Tariff will be listed on the Tariffs page.</p><p><br></p><p><img style=\"cursor: default;\" src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/4989564/original/TariffsandRates_Tariffs_AddNewTariff.png?1366371381\" class=\"fr-dii\"></p><p>To <strong>update an existing Tariff</strong>, in the Tariffs table, select the name of the Tariff you wish to update (e.g., \"Test Tariff\"). Each Tariff will appear as a link inside the Tariffs table. Update the desired values. When you are done, select Save &amp; Close. The Tariff will be updated, and you will return to the Tariffs page.<br><br>To <strong>delete an existing Tariff</strong>, in the table of Tariffs, locate the Tariff you wish to delete and click on the red X in the Action column.  The Tariff will be deleted and you will return to the Tariff page.  </p><p><span style=\"font-size: 18px;\"><br></span></p><h3><span style=\"font-size: 18px;\">Adding, Updating, and Deleting New Rates</span></h3><p><br>To <strong>add Rates</strong> to a Tariff, locate the Tariff you wish to modify in the table of Tariffs.  On the row associated with that Tariff, select Open Rates under the Action column.  On the Rates page associated with the Tariff, you can add Rates either individually or by uploading a file containing the Rates and values you wish to add.  Rates page is shown below:</p><p><br></p><p><img style=\"cursor: default;\" src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/4989593/original/TariffsandRates_Rates.png?1366371527\" class=\"fr-dii\"></p><p><br></p><h3><span style=\"font-size: 18px;\">Method 1: Individually</span></h3><p><br>When adding, updating, or deleting one or a small number of Rates, it is sometimes efficient to do so individually.<br><br>To <strong>add a new Rate</strong>, select \"Add\" under the Add Rate section associated with the Tariff.  Enter the desired values, noting that you must enter a Prefix, and that each Prefix can be associated with at most one Rate.  For example, the Prefix \"1604\" refers to the geographic region Vancouver, British Columbia, Canada.  When you are done, select Save &amp; Close.  The Rate you add will be listed in the Rates page associated with the Tariff.</p><p><br></p><p><img style=\"cursor: default;\" src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/4989633/original/TariffsandRates_Rates_AddNewRate.png?1366371660\" class=\"fr-dii\"></p><p><br></p><p>To <strong>update an existing Rate</strong>, locate the Rate you wish to update. On the row associated with that Rate, select the Prefix under the Prefix column, which appears as a link. Update the desired values, noting as discussed above that each Prefix can only be associated with one Rate. When you are done, click Save &amp; Close. The Rate will be updated, and you will return to the Rates page associated with the Tariff.<br><br>To <strong>delete an existing Rate</strong>, locate the Rate you wish to delete. On the row associated with that Rate, click on the red X under the Action column.  The Rate will be deleted, and you will return to the Rates page associated with the Tariff.</p><p><br></p><h3><span style=\"font-size: 18px;\">Method 2: Uploading a File - Your Rate Deck</span></h3><h3><br></h3><p><br>As an alternative to adding, updating, or deleting Rates individually, it may be more convenient to do so by uploading a file containing Rates, especially when a large number of Rates is involved. The two main file types you can use to upload the Rates and desired values are (a) Microsoft Excel [.xls] files and (2) Comma-separated value [.csv] files.<br><br>To begin, go to the Rates page associated with the Tariff.  Under the Download Rates section, select \"Download\" to download the .xls file, e.g., \"[Tariff Name] Rates.xls\".  Once downloaded, open the file using a spreadsheet application, e.g. Microsoft Excel.  The spreadsheet displays the Rates associated with the Tariff (shown below): each Rate is displayed on a row and is associated with a unique ID automatically generated by the system.  By modifying, saving, and uploading the spreadsheet, you can add, update, and delete a large number of Rates all at once.</p><p><br></p><p><img style=\"cursor: default;\" src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/4989676/original/TariffsandRates_TestTariffRatesinSpreadsheet.png?1366371776\" class=\"fr-dii\"></p><p><br></p><p><strong><em>Action [A|D|U|S|SA]</em></strong><br><br>Entering \"A\" adds a new Rate for a given Prefix, entering \"D\" deletes an existing Rate, entering \"U\" updates an existing Rate according to the associated Id. Entering \"S\" updates an existing Rate according to the associated Prefix, and entering \"SA\" functions as either \"A\" or \"S\" (depending on whether the Prefix entered is already associated with an Id). See below for details.<br><br><em><strong>Id</strong></em><br><br>The unique Rate Id is automatically generated by the system. You do not need to enter a value but if you do, the system will ignore it.<br><br><strong><em>Prefix</em></strong><br><br>The Prefix is associated with phone numbers. You must enter a Prefix, and this value cannot already be associated with another Rate.<br><br><em><strong>Country</strong></em><br><br>The country is automatically generated by the system according to the associated Prefix. You do not need to enter a value but if you do, the system will ignore it.<br><br><strong><em>Interval 1</em></strong><br><br>This must be a non-negative integer corresponding to <strong>Interval 1</strong>, sec under the Billing Parameters section when adding or updating a Rate individually (see above).<br><br><strong><em>Interval N</em></strong><br><br>This must be a non-negative integer corresponding to<strong> Interval N</strong>, sec under the Billing Parameters section when adding or updating a Rate individually (see above).<br><br><strong><em>Price 1</em></strong><br><br>This must be a non-negative integer corresponding to <strong>Price 1, USD/min</strong> under the Billing Parameters section when adding or updating a Rate individually (see above).<br><br><strong><em>Price N</em></strong><br><br>This must be a non-negative integer corresponding to <strong>Price N, USD/min</strong> under the Billing Parameters section when adding or updating a Rate individually (see above).<br><br><em><strong>Forbidden</strong></em></p><p><br></p><p dir=\"ltr\" style=\"line-height: 1.62; margin-bottom: 0pt;\"><span style=\"font-size: 10pt; font-family: Roboto, sans-serif; color: rgb(24, 50, 71); font-weight: 400;\">This must be either \"0\" or \"1\", corresponding to the </span><span style=\"font-size: 10pt; font-family: Roboto, sans-serif; color: rgb(24, 50, 71); font-weight: 700;\">Forbidden</span><span style=\"font-size: 10pt; font-family: Roboto, sans-serif; color: rgb(24, 50, 71); font-weight: 400;\"> checkbox under the Basic Parameters section (when adding or updating a Rate individually - see above). A \"0\" indicates that the geographic region associated with the Prefix is not forbidden, i.e., permitted. A \"1\" indicates that the associated geographic region is forbidden.</span></p><p><br><em><strong>Grace Period</strong></em><br><br>This must be either \"0\" or \"1\", corresponding to the <strong>Enable Grace Period</strong> checkbox under the Billing Parameters section (when adding or updating a Rate individually - see above).  A \"0\" indicates that the grace period is disabled.  A \"1\" indicates that the grace period is enabled.<br><br>To add, update, or delete  Rates, you will need to enter values under the Action [A|D|U|S|SA] (\"Action\") column associated with the row of the Rate you wish to add, update, or delete.<br><br>To <strong>add a new Rate for a given Prefix</strong>, insert a new row below the existing rows. In the new row, enter \"A\" under the Action column.  You must enter values under each of the columns, except possibly the Id and Country columns. The Id column is automatically generated for the Rate by the system and the Country is automatically generated in accordance with the Prefix. In this case, you must ensure that the Prefix you enter is not already associated with a Rate in the system; if it is, the system will generate an error message.<br><br>To <strong>update</strong> <strong>an existing Rate by Id</strong>, enter \"U\" under the Action column of the Rate you wish to update.  Update the desired values corresponding to that Rate, be careful not to edit the Id (because the system identifies a Rate by its Id, and editing the Id means that the system cannot identify the Rate you wish to update).<br><br>To <strong>update an existing Rate by Prefix</strong>, insert a new row below the existing rows.  In this new row, enter<strong> \"<em>S\"</em></strong> under the Action column and the Prefix you wish to update.  Note that in this case, the system identifies a Rate by its (unique) Prefix, rather than by its Id.  This method of updating a Rate (by identifying it by its Prefix rather than by its Id) is useful when you have a long list because you can update Rate values corresponding to the Prefix without knowing its Id.<br><br>To <strong>add a new Rate for a given Prefix or to update the existing Rate</strong> associated with the Prefix, insert a new row below the existing rows.  In this new row, enter \"<em><strong>SA\"</strong></em> under the Action column.  You must enter values under each of the columns, except possibly the Id and Country columns (since the Id is automatically generated for the Rate by the system and the Country is automatically generated in accordance with the Prefix).  In this case, you need not ensure that the Prefix you enter is not already associated with a Rate in the system.  If the Prefix is not already associated with a Rate, the system adds the new Rate. If the Prefix is already associated with a Rate, the system updates that Rate with the new values you enter.<br><br>To <strong>delete an existing Rate</strong>, enter <em><strong>D</strong> </em>under the Action column.</p><p><img style=\"cursor: default;\" src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/4989866/original/TariffsandRates_TestTariffRatesinSpreadsheet_Modifications.png?1366372189\" class=\"fr-dii\"></p><p><br></p><p>When you are done adding, updating, or deleting Rates in your spreadsheet, save the file.  On the Rates page associated with the Tariff, look for the Upload Rates section, and click \"Choose File\".  Select the saved Rates file, and then select \"Upload\".<br><br>If your modifications have been successfully made, a dialog box will appear indicating the number of rows processed, commands recognized, and records added, updated, and deleted.  Click OK.</p><p><br></p><p><img style=\"cursor: default;\" src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/4989879/original/TariffsandRates_Rates_UploadSuccessful.png?1366372238\" class=\"fr-dii\"></p><p><br></p><p>If your modifications have not been successfully made, the system prompts you to open or download (depending on your internet browser's specifications) a .xls file detailing the errors found in the Error Message column associated with a Rate.  In this case, correct the errors found in the saved Rates file and upload the corrected file.</p><p><br></p><p><img src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/4989889/original/TariffsandRates_Rates_UploadUnsuccessful.png?1366372269\" class=\"fr-dii\"></p>",
  "description_text": " Tariffs and Rates   A Tariff is a logical element in the system which represents the rules for rating and billing the calls made by an Account or Customer. Each Tariff includes a set of Rates that define the prices to be charged for calls to different destinations. Tariffs are created by Customers. Each Customer has its own set of Tariffs it can assign to his own sub-Customers or Accounts. The system ensures that sub-Customers can only see the Tariffs that apply to them directly.  There can be more than one Rate matching a destination number; in such cases, the Rate with the longest prefix is used.  For example, if the destination number is 1234567890 and there are two Rates, each with the prefix 1 and 12 respectively, the Rate with the prefix 12 would be selected for rating and billing purposes.  It is important to know that Accounts or Customers cannot complete calls to destinations for which a Rate is not configured.      Changes to Rates, Routes, Destination Sets, Tariffs, DID numbers, DID Charging Groups and Routing Groups may not be applied immediately.  You need to wait at least for 1 minute before the system can update its internal \"cache\". Sometimes; for example,  in case of a heavy bulk update of multiple destination sets, it may be necessary to wait more than 1 minute. Read more about System Cache...      Adding, Updating, and Deleting a Tariff     On the Tariffs page (shown below), you can add a new Tariff, update an existing Tariff, or delete an existing Tariff.          To add a new Tariff, inside the Add Tariff section, select Add New.  On the Add New Tariff page, enter the desired values inside the Basic Parameters and Advanced Parameters sections.  Note that you must enter a Tariff Name.  When you are done, select Save & Close.  The new Tariff will be listed on the Tariffs page.       To update an existing Tariff, in the Tariffs table, select the name of the Tariff you wish to update (e.g., \"Test Tariff\"). Each Tariff will appear as a link inside the Tariffs table. Update the desired values. When you are done, select Save & Close. The Tariff will be updated, and you will return to the Tariffs page.  To delete an existing Tariff, in the table of Tariffs, locate the Tariff you wish to delete and click on the red X in the Action column.  The Tariff will be deleted and you will return to the Tariff page.       Adding, Updating, and Deleting New Rates   To add Rates to a Tariff, locate the Tariff you wish to modify in the table of Tariffs.  On the row associated with that Tariff, select Open Rates under the Action column.  On the Rates page associated with the Tariff, you can add Rates either individually or by uploading a file containing the Rates and values you wish to add.  Rates page is shown below:          Method 1: Individually   When adding, updating, or deleting one or a small number of Rates, it is sometimes efficient to do so individually.  To add a new Rate, select \"Add\" under the Add Rate section associated with the Tariff.  Enter the desired values, noting that you must enter a Prefix, and that each Prefix can be associated with at most one Rate.  For example, the Prefix \"1604\" refers to the geographic region Vancouver, British Columbia, Canada.  When you are done, select Save & Close.  The Rate you add will be listed in the Rates page associated with the Tariff.          To update an existing Rate, locate the Rate you wish to update. On the row associated with that Rate, select the Prefix under the Prefix column, which appears as a link. Update the desired values, noting as discussed above that each Prefix can only be associated with one Rate. When you are done, click Save & Close. The Rate will be updated, and you will return to the Rates page associated with the Tariff.  To delete an existing Rate, locate the Rate you wish to delete. On the row associated with that Rate, click on the red X under the Action column.  The Rate will be deleted, and you will return to the Rates page associated with the Tariff.     Method 2: Uploading a File - Your Rate Deck      As an alternative to adding, updating, or deleting Rates individually, it may be more convenient to do so by uploading a file containing Rates, especially when a large number of Rates is involved. The two main file types you can use to upload the Rates and desired values are (a) Microsoft Excel [.xls] files and (2) Comma-separated value [.csv] files.  To begin, go to the Rates page associated with the Tariff.  Under the Download Rates section, select \"Download\" to download the .xls file, e.g., \"[Tariff Name] Rates.xls\".  Once downloaded, open the file using a spreadsheet application, e.g. Microsoft Excel.  The spreadsheet displays the Rates associated with the Tariff (shown below): each Rate is displayed on a row and is associated with a unique ID automatically generated by the system.  By modifying, saving, and uploading the spreadsheet, you can add, update, and delete a large number of Rates all at once.          Action [A|D|U|S|SA]  Entering \"A\" adds a new Rate for a given Prefix, entering \"D\" deletes an existing Rate, entering \"U\" updates an existing Rate according to the associated Id. Entering \"S\" updates an existing Rate according to the associated Prefix, and entering \"SA\" functions as either \"A\" or \"S\" (depending on whether the Prefix entered is already associated with an Id). See below for details.  Id  The unique Rate Id is automatically generated by the system. You do not need to enter a value but if you do, the system will ignore it.  Prefix  The Prefix is associated with phone numbers. You must enter a Prefix, and this value cannot already be associated with another Rate.  Country  The country is automatically generated by the system according to the associated Prefix. You do not need to enter a value but if you do, the system will ignore it.  Interval 1  This must be a non-negative integer corresponding to Interval 1, sec under the Billing Parameters section when adding or updating a Rate individually (see above).  Interval N  This must be a non-negative integer corresponding to Interval N, sec under the Billing Parameters section when adding or updating a Rate individually (see above).  Price 1  This must be a non-negative integer corresponding to Price 1, USD/min under the Billing Parameters section when adding or updating a Rate individually (see above).  Price N  This must be a non-negative integer corresponding to Price N, USD/min under the Billing Parameters section when adding or updating a Rate individually (see above).  Forbidden     This must be either \"0\" or \"1\", corresponding to the Forbidden checkbox under the Basic Parameters section (when adding or updating a Rate individually - see above). A \"0\" indicates that the geographic region associated with the Prefix is not forbidden, i.e., permitted. A \"1\" indicates that the associated geographic region is forbidden.   Grace Period  This must be either \"0\" or \"1\", corresponding to the Enable Grace Period checkbox under the Billing Parameters section (when adding or updating a Rate individually - see above).  A \"0\" indicates that the grace period is disabled.  A \"1\" indicates that the grace period is enabled.  To add, update, or delete  Rates, you will need to enter values under the Action [A|D|U|S|SA] (\"Action\") column associated with the row of the Rate you wish to add, update, or delete.  To add a new Rate for a given Prefix, insert a new row below the existing rows. In the new row, enter \"A\" under the Action column.  You must enter values under each of the columns, except possibly the Id and Country columns. The Id column is automatically generated for the Rate by the system and the Country is automatically generated in accordance with the Prefix. In this case, you must ensure that the Prefix you enter is not already associated with a Rate in the system; if it is, the system will generate an error message.  To update an existing Rate by Id, enter \"U\" under the Action column of the Rate you wish to update.  Update the desired values corresponding to that Rate, be careful not to edit the Id (because the system identifies a Rate by its Id, and editing the Id means that the system cannot identify the Rate you wish to update).  To update an existing Rate by Prefix, insert a new row below the existing rows.  In this new row, enter \"S\" under the Action column and the Prefix you wish to update.  Note that in this case, the system identifies a Rate by its (unique) Prefix, rather than by its Id.  This method of updating a Rate (by identifying it by its Prefix rather than by its Id) is useful when you have a long list because you can update Rate values corresponding to the Prefix without knowing its Id.  To add a new Rate for a given Prefix or to update the existing Rate associated with the Prefix, insert a new row below the existing rows.  In this new row, enter \"SA\" under the Action column.  You must enter values under each of the columns, except possibly the Id and Country columns (since the Id is automatically generated for the Rate by the system and the Country is automatically generated in accordance with the Prefix).  In this case, you need not ensure that the Prefix you enter is not already associated with a Rate in the system.  If the Prefix is not already associated with a Rate, the system adds the new Rate. If the Prefix is already associated with a Rate, the system updates that Rate with the new values you enter.  To delete an existing Rate, enter D under the Action column.       When you are done adding, updating, or deleting Rates in your spreadsheet, save the file.  On the Rates page associated with the Tariff, look for the Upload Rates section, and click \"Choose File\".  Select the saved Rates file, and then select \"Upload\".  If your modifications have been successfully made, a dialog box will appear indicating the number of rows processed, commands recognized, and records added, updated, and deleted.  Click OK.          If your modifications have not been successfully made, the system prompts you to open or download (depending on your internet browser's specifications) a .xls file detailing the errors found in the Error Message column associated with a Rate.  In this case, correct the errors found in the saved Rates file and upload the corrected file.      ",
  "seo_data": {
    "meta_title": "",
    "meta_description": "",
    "meta_keywords": ""
  },
  "tags": [
    "split billing",
    "Billing Intervals",
    "Tariffs"
  ],
  "attachments": [],
  "cloud_files": [],
  "thumbs_up": 7,
  "thumbs_down": 10,
  "hits": 4326,
  "suggested": 0,
  "feedback_count": 0,
  "collaboration": {
    "convo_token": "eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJUeXBlIjoiYXJ0aWNsZSIsIkNvbnZvSWQiOiI3NzQ2Ny1lbiIsIlVzZXJJZCI6IjMwMTIwODk1MjQiLCJleHAiOjE2MzUzNzEwMTB9.jebAf7MZ0E_Mg93Epo-_MMZycfXdBPsW15JWE6v1leA"
  }
}