{
  "id": 3000058057,
  "type": 1,
  "status": 2,
  "agent_id": 3763909,
  "created_at": "2016-09-15T12:15:16Z",
  "category_id": 81138,
  "folder_id": 134740,
  "title": " Security management",
  "updated_at": "2020-04-02T16:06:32Z",
  "description": "<div dir=\"ltr\"><div dir=\"ltr\"><div dir=\"ltr\"><div dir=\"ltr\"><p><u><font size=\"4\">General</font></u></p><p><br></p><p>This document describes ways of improving security and protecting your system from fraud.</p><p><u><font size=\"4\"><br></font></u></p><p><font size=\"3\"><strong>Listed is an overview of Sippy's current security features:</strong></font></p><p><br></p><ul><li><strong>Complicated passwords</strong> - default password template is a minimum of 7 alphanumeric digits. Password templates are customized by on a per-account basis by our support team.</li><li><strong>Password Strength indicator - </strong>Password strength is shown to users when user passwords expire or are created for the first time (Starting in 5.2).</li><li><strong>Multi Factored Authentication</strong> - Switch operators can enable multi-factored authentication for web users.  Users will have the option to use an email based system or google authentication (Starting in Sippy 2020).</li><li><strong>SSL Certificates - </strong>SSL certificates can be generated from the softswitch via <a href=\"https://support.sippysoft.com/en/support/solutions/articles/3000070011-ssl-certificates-for-web\" rel=\"noreferrer\" target=\"_blank\">Let's Encrypt</a>.  This is a free service if you have a domain name assigned for your softswitch.  Users can still <a href=\"https://support.sippysoft.com/en/support/solutions/articles/78262-generating-and-installing-ssl-certificate\" rel=\"noreferrer\" target=\"_blank\">upload their own SSL certificates</a> for their system.</li><li><strong>Encrypted passwords</strong> - passwords are encrypted when saved and cannot be retrieved from the database.</li><li><strong>Separate VoIP credentials for Digest Authentication</strong> - different web and SIP traffic credentials for Accounts, accessibility and user security.</li><li><strong>Sophisticated VoIP traffic Authentication</strong> - Combined Remote IP, Incoming CLI and Incoming CLD authentication to authenticate traffic to an Account.</li><li><strong>Account session limits</strong> - Total session limits (inbound/outbound combined) protect each Account from traffic flooding resulting from Account hacking.</li><li><strong>Account CPS limits</strong> - CPS limits protect an Account from traffic flooding that results from hacked Accounts.</li><li><strong>Account Balance token system</strong> - Real-time Account's Balance apply logic to incoming call attempts referencing remaining Balance/Credit, calls cost/rate, and calls in progress to allow additional calls to pass.</li><li><strong><a href=\"https://support.sippysoft.com/en/support/solutions/articles/3000093126-firewall-settings\" rel=\"noreferrer\" target=\"_blank\">Built-in Firewall</a> for additional network security layer</strong> - Web, SSH, DB, and SIP traffic firewall rules.</li><li><strong>Web Access Control restriction</strong> - restrict staff web login to specified IP addresses/locations.</li><li><strong>User Audit logs</strong> - Monitor changes made by staff and track when they access the softswitch and from where.</li><li><strong>Connection channel and CPS limits</strong> - restrictive routing and capping of calls to specified upstream locations.</li><li><strong>Adjust a default password_policy template - </strong>to adjust, request that the support team provides you the default parameters that your system uses and adjust them if needed.</li><li>In-house framework (Sippy B2BUA &amp; RTPproxy) ensures Sippy is not remotely vulnerable to industry-wide security and fraud attacks.</li><li><strong>Proper ACD value set in tariff</strong>, with the ACD=Max session time, the system will never push an Account's or Customer's balance below zero, a drawback of this security feature is that it can result in some calls being dropped.</li><li><strong>Transparent <a href=\"https://support.sippysoft.com/solution/articles/78256-external-firewall-setup-for-use-with-sippy-softswitch\" rel=\"nofollow\">external firewall</a></strong> is recommended for handling complicated rules and to protect an overload of the network card from fraudulent traffic/packets or any DDOS attack.</li><li><strong>Use PINs for vouchers</strong> if they are used.</li><li><strong>Use PINs for accounts</strong> if calling cards are used.</li><li><strong>Avoid using authentication rules with only CLI/CLD</strong>, the IP address adds extra security to the authentication.</li><li><strong>Use authentication by Vendor/Connection in the DID authentication rules</strong> if DIDs are used in the scenario.</li><li><strong>Mask topology of your network using the media relay feature</strong> that proxies the RTP and hides the original IP of a device.</li><li><strong>Use your own VPN server if your staff is seating on a dynamic IP.</strong>  Such an approach would make connection to the Sippy server more secure, allow you to configure a web firewall, and restrict suspicious attempts from accessing the web/db/ssh from unknown IPs.</li><li>In-house framework (Sippy B2BUA &amp; RTP Proxy) ensures Sippy is not remotely vulnerable to industry-wide security and fraud attacks.</li></ul><br>Steps to take to secure your Sippy Softswitch:<br><br><br><table style=\"width: 100%;\"><tbody><tr><td style=\"width: 4.4726%;\"><br></td><td style=\"width: 19.0717%;\"><div style=\"text-align: center;\">Feature</div></td><td style=\"width: 24.0506%;\"><div style=\"text-align: center;\">Location</div></td><td style=\"width: 27.7789%; text-align: center;\">Note</td><td style=\"width: 24.5418%;\"><div style=\"text-align: center;\">Document</div></td></tr><tr><td style=\"width: 4.4726%;\"><div style=\"text-align: center;\">1.</div></td><td style=\"width: 19.0717%;\">Complicated passwords</td><td style=\"width: 24.0506%;\">My Preferences &gt; Web Password<br>My Staff &gt; Users &gt; User's parameters</td><td style=\"width: 27.7789%;\">User password leaking is the number 1 cause of fraud across all forms of software.  Set significantly complicated passwords for your users to prevent unauthorized access.</td><td style=\"width: 24.5418%;\"><br></td></tr><tr><td style=\"width: 4.4726%;\"><div style=\"text-align: center;\">2.</div></td><td style=\"width: 19.0717%;\"><a href=\"https://support.sippysoft.com/en/support/solutions/articles/3000093126-firewall-settings\" rel=\"noreferrer\" target=\"_blank\">IP Firewall</a></td><td style=\"width: 24.0506%;\">System Management &gt; Tools &gt; Ip Firewall</td><td style=\"width: 27.7789%;\">Prevent unwanted traffic or hacking attempts through SSH, SIP, Web, and DB firewall configuration.</td><td style=\"width: 24.5418%;\">See below for simple configuration guidelines.</td></tr><tr><td style=\"width: 4.4726%;\"><div style=\"text-align: center;\">3.</div></td><td style=\"width: 19.0717%;\">External Firewall (if required)</td><td style=\"width: 24.0506%;\">External service.</td><td style=\"width: 27.7789%;\">Configure an external firewall in front of Sippy to help prevent DDoS attacks, port scanning etc.<br>This is a network application.</td><td style=\"width: 24.5418%;\"><a href=\"http://support.sippysoft.com/solution/articles/78256-external-firewall-setup-for-use-with-sippy-softswitch\" rel=\"noreferrer noopener\">External Firewall setup for use with Sippy Softswitch</a></td></tr><tr><td style=\"width: 4.4726%;\"><div style=\"text-align: center;\">4.</div></td><td style=\"width: 19.0717%;\">Web Access Control</td><td style=\"width: 24.0506%;\">Profile &gt; My Preferences<br>My Staff &gt; Users &gt; User's parameters</td><td style=\"width: 27.7789%;\">Restrict access to the Sippy Softswitch through User accounts by configuring your IP's into the web access control field. Only operators from the specified IP will gain access to your switch.</td><td style=\"width: 24.5418%;\">See below for simple configuration guidelines.</td></tr><tr><td style=\"width: 4.4726%;\"><div style=\"text-align: center;\">5.</div></td><td style=\"width: 19.0717%;\">Overdraft protection</td><td style=\"width: 24.0506%;\">Billing &gt; Tariff &gt; Average Call Duration</td><td style=\"width: 27.7789%;\">Sippy passes calls based on a balance token system that is governed by the Average Call Duration on Tariff. Longer Average call Duration will result in fewer calls passing when an Account's balance is low.</td><td style=\"width: 24.5418%;\"><br></td></tr><tr><td style=\"width: 4.4726%;\"><div style=\"text-align: center;\">6.</div></td><td style=\"width: 19.0717%;\">SNMP monitoring traffic flagging.</td><td style=\"width: 24.0506%;\">External service.</td><td style=\"width: 27.7789%;\">Configure an SNMP application as an external service to monitor and alert to traffic spikes and unwanted access attempts.</td><td style=\"width: 24.5418%;\"><a href=\"http://support.sippysoft.com/solution/articles/81166-using-snmp-to-monitor-sippy-softswitch-statistics\" rel=\"noreferrer noopener\">Using SNMP to monitor Sippy Softswitch statistics<br></a></td></tr></tbody></table><br>The Sippy softswitch has been developed with security features that are in line with our goal of producing the most secure softswitch on the market.<br><u><font size=\"4\"><br></font></u><br><font size=\"4\"><u>Web access control</u><br></font><br><font size=\"2\"><br></font><font size=\"4\"><font size=\"2\">The<strong> Web access control</strong> feature allows a Sippy softswitch owner to specify the exact list of IPs for web access.  Each particular web-user can be specified in the \"My Preferences\" menu of the Customer or web user.  Thus, only listed IPs are able to login to the web with the credentials of that user.</font></font><br><font size=\"4\"><font size=\"2\">By default the owner will see the value \"Any\" in the \"Allowed Hosts\" field.  \"Any\" means that anyone can access the web interface with the proper login and password.  You can specify a list of IPs with comma separated values; in this configuration, only clients from the list or IPs would be able to login to the web interface provided that they have the proper login and password.  </font></font><br><font size=\"4\"><font size=\"2\"><br></font></font><br><font size=\"4\"><font size=\"2\"><img src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/3022306360/original/web%20access%20control.png?1473941492\" class=\"inline-image fr-dii\" data-id=\"3022306360\"></font></font><br><font size=\"4\"><font size=\"2\"><u><font size=\"4\">IP Firewall tool</font></u><br><br>The IP firewall tool allows you to restrict access to the database, web interface, SSH or SIP traffic from static IPs.  You can add rules to the firewall list in the following menu: \"Tools\" &gt; \"IP Firewall\" (see screen-shot for your reference).<br></font></font><br><font size=\"4\"><font size=\"2\"><img src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/3022308233/original/firewall_page.png?1473944237\" class=\"inline-image fr-dii\" data-id=\"3022308233\"></font></font><br><font size=\"4\"><font size=\"2\">The IP firewall can be configured only for static IP addresses.  Also, note that the netmask should be 255.255.255.255 if you want to block or allow only one particular IP address.  In case of a dynamic IP, we suggest to use a trusted VPN server for access to the softswitch web interface.<br></font></font></div><div dir=\"ltr\"><br></div><div dir=\"ltr\"><font size=\"4\"><font size=\"2\">Starting from Sippy 5.1 (or greater) there is a security feature that warns the softswitch operator (if he has permissions to edit the firewall rules) to allow access to the switch to known IP addresses, and deny access to any unknown IP address.  The warning is controlled from the Security Alerts section in the IP Firewall Tool, based on the type of firewall (DB, SIP, SSH or Web).  If an external firewall is used the warning can be disabled by removing the selection from checkbox:</font></font></div><p><br></p><div dir=\"ltr\"><font size=\"4\"><font size=\"2\"><img style=\"width: 695px; height: 187.431px;\" data-uniquekey=\"1532097000627\" data-fileid=\"3037965840\" data-filelink=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/3037965840/original/xmGOW-vPdafjAU3UxtKEUEMiKqLH5xV5KA?1532097291\" class=\"fr-dii\" src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/3037965840/original/xmGOW-vPdafjAU3UxtKEUEMiKqLH5xV5KA?1532097291\" alt=\"\"></font></font></div><div dir=\"ltr\"><br></div><div dir=\"ltr\"><font size=\"4\"><font size=\"2\"><font size=\"4\">Audit log tool</font><br>The Audit log feature is available only for a Root Customer user.  Audit Log Tool can be accessed from System Management --&gt; Tools --&gt; Audit Log Viewer</font></font><div dir=\"ltr\"><br></div><h2><font size=\"4\"><font size=\"2\"><span style=\"font-size: 18px;\">How to setup an external firewall with Sippy Software:</span></font></font></h2><a href=\"https://support.sippysoft.com/solution/articles/78256-external-firewall-setup-for-use-with-sippy-softswitch\" rel=\"noreferrer noopener\" target=\"_blank\">External Firewall setup for use with Sippy Softswitch</a></div><div dir=\"ltr\"><br></div><div dir=\"ltr\"><h3>Multi Factor Authentication:</h3><p>For details on how Multi Factor authentication works please view the following support article: </p><a href=\"https://support.sippysoft.com/a/solutions/articles/3000092540-multi-factored-authentication-web-users-\" target=\"_top\">https://support.sippysoft.com/a/solutions/articles/3000092540-multi-factored-authentication-web-users-</a> <p><br></p><p><br></p></div></div></div></div>",
  "description_text": "     General     This document describes ways of improving security and protecting your system from fraud.     Listed is an overview of Sippy's current security features:      Complicated passwords - default password template is a minimum of 7 alphanumeric digits. Password templates are customized by on a per-account basis by our support team.  Password Strength indicator - Password strength is shown to users when user passwords expire or are created for the first time (Starting in 5.2).  Multi Factored Authentication - Switch operators can enable multi-factored authentication for web users.  Users will have the option to use an email based system or google authentication (Starting in Sippy 2020).  SSL Certificates - SSL certificates can be generated from the softswitch via Let's Encrypt.  This is a free service if you have a domain name assigned for your softswitch.  Users can still upload their own SSL certificates for their system.  Encrypted passwords - passwords are encrypted when saved and cannot be retrieved from the database.  Separate VoIP credentials for Digest Authentication - different web and SIP traffic credentials for Accounts, accessibility and user security.  Sophisticated VoIP traffic Authentication - Combined Remote IP, Incoming CLI and Incoming CLD authentication to authenticate traffic to an Account.  Account session limits - Total session limits (inbound/outbound combined) protect each Account from traffic flooding resulting from Account hacking.  Account CPS limits - CPS limits protect an Account from traffic flooding that results from hacked Accounts.  Account Balance token system - Real-time Account's Balance apply logic to incoming call attempts referencing remaining Balance/Credit, calls cost/rate, and calls in progress to allow additional calls to pass.  Built-in Firewall for additional network security layer - Web, SSH, DB, and SIP traffic firewall rules.  Web Access Control restriction - restrict staff web login to specified IP addresses/locations.  User Audit logs - Monitor changes made by staff and track when they access the softswitch and from where.  Connection channel and CPS limits - restrictive routing and capping of calls to specified upstream locations.  Adjust a default password_policy template - to adjust, request that the support team provides you the default parameters that your system uses and adjust them if needed.  In-house framework (Sippy B2BUA & RTPproxy) ensures Sippy is not remotely vulnerable to industry-wide security and fraud attacks.  Proper ACD value set in tariff, with the ACD=Max session time, the system will never push an Account's or Customer's balance below zero, a drawback of this security feature is that it can result in some calls being dropped.  Transparent external firewall is recommended for handling complicated rules and to protect an overload of the network card from fraudulent traffic/packets or any DDOS attack.  Use PINs for vouchers if they are used.  Use PINs for accounts if calling cards are used.  Avoid using authentication rules with only CLI/CLD, the IP address adds extra security to the authentication.  Use authentication by Vendor/Connection in the DID authentication rules if DIDs are used in the scenario.  Mask topology of your network using the media relay feature that proxies the RTP and hides the original IP of a device.  Use your own VPN server if your staff is seating on a dynamic IP.  Such an approach would make connection to the Sippy server more secure, allow you to configure a web firewall, and restrict suspicious attempts from accessing the web/db/ssh from unknown IPs.  In-house framework (Sippy B2BUA & RTP Proxy) ensures Sippy is not remotely vulnerable to industry-wide security and fraud attacks.   Steps to take to secure your Sippy Softswitch:        Feature    Location   Note   Document    1.   Complicated passwords  My Preferences > Web Password My Staff > Users > User's parameters  User password leaking is the number 1 cause of fraud across all forms of software.  Set significantly complicated passwords for your users to prevent unauthorized access.      2.   IP Firewall  System Management > Tools > Ip Firewall  Prevent unwanted traffic or hacking attempts through SSH, SIP, Web, and DB firewall configuration.  See below for simple configuration guidelines.   3.   External Firewall (if required)  External service.  Configure an external firewall in front of Sippy to help prevent DDoS attacks, port scanning etc. This is a network application.  External Firewall setup for use with Sippy Softswitch   4.   Web Access Control  Profile > My Preferences My Staff > Users > User's parameters  Restrict access to the Sippy Softswitch through User accounts by configuring your IP's into the web access control field. Only operators from the specified IP will gain access to your switch.  See below for simple configuration guidelines.   5.   Overdraft protection  Billing > Tariff > Average Call Duration  Sippy passes calls based on a balance token system that is governed by the Average Call Duration on Tariff. Longer Average call Duration will result in fewer calls passing when an Account's balance is low.      6.   SNMP monitoring traffic flagging.  External service.  Configure an SNMP application as an external service to monitor and alert to traffic spikes and unwanted access attempts.  Using SNMP to monitor Sippy Softswitch statistics   The Sippy softswitch has been developed with security features that are in line with our goal of producing the most secure softswitch on the market.   Web access control   The Web access control feature allows a Sippy softswitch owner to specify the exact list of IPs for web access.  Each particular web-user can be specified in the \"My Preferences\" menu of the Customer or web user.  Thus, only listed IPs are able to login to the web with the credentials of that user. By default the owner will see the value \"Any\" in the \"Allowed Hosts\" field.  \"Any\" means that anyone can access the web interface with the proper login and password.  You can specify a list of IPs with comma separated values; in this configuration, only clients from the list or IPs would be able to login to the web interface provided that they have the proper login and password.      IP Firewall tool  The IP firewall tool allows you to restrict access to the database, web interface, SSH or SIP traffic from static IPs.  You can add rules to the firewall list in the following menu: \"Tools\" > \"IP Firewall\" (see screen-shot for your reference).   The IP firewall can be configured only for static IP addresses.  Also, note that the netmask should be 255.255.255.255 if you want to block or allow only one particular IP address.  In case of a dynamic IP, we suggest to use a trusted VPN server for access to the softswitch web interface.      Starting from Sippy 5.1 (or greater) there is a security feature that warns the softswitch operator (if he has permissions to edit the firewall rules) to allow access to the switch to known IP addresses, and deny access to any unknown IP address.  The warning is controlled from the Security Alerts section in the IP Firewall Tool, based on the type of firewall (DB, SIP, SSH or Web).  If an external firewall is used the warning can be disabled by removing the selection from checkbox:          Audit log tool The Audit log feature is available only for a Root Customer user.  Audit Log Tool can be accessed from System Management --> Tools --> Audit Log Viewer    How to setup an external firewall with Sippy Software: External Firewall setup for use with Sippy Softswitch      Multi Factor Authentication:  For details on how Multi Factor authentication works please view the following support article:  https://support.sippysoft.com/a/solutions/articles/3000092540-multi-factored-authentication-web-users-           ",
  "seo_data": {
    "meta_title": "",
    "meta_description": "",
    "meta_keywords": ""
  },
  "tags": [
    "Security",
    "Firewall",
    "Multi Factor Authentication",
    "MFA",
    "Password Policies",
    "SSL Certificates"
  ],
  "attachments": [],
  "cloud_files": [],
  "thumbs_up": 9,
  "thumbs_down": 1,
  "hits": 3526,
  "suggested": 0,
  "feedback_count": 0,
  "collaboration": {
    "convo_token": "eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJUeXBlIjoiYXJ0aWNsZSIsIkNvbnZvSWQiOiIzMDAwMDU4MDU3LWVuIiwiVXNlcklkIjoiMzAxMjA4OTUyNCIsImV4cCI6MTYzNTM3MTA0NX0.bu3Zlv_1TMpGHZU5eqzN9TGeY8iRnGPgTPxixV4r8ho"
  }
}